Notes/Lecture_03.org
#+TITLE: Structural modeling process
#+AUTHOR: Gabriel Petrini
#+DATE: September 1st, 2020
#+LATEX_HEADER: \bibliography{References.bib}
#+LATEX_HEADER: \usepackage{minted}

* Pre-class reading: Practical Issues in Structural Estimation ([[https://www.youtube.com/watch?v=0hazaPBAYWE][Keane YouTube talk, 2015]])

** Structural Model Development

Structural estimation has several key stages

*** Theoretical model development

Assume you want to build a structural model to address an *economic or policy question of interest*. A good starting point is to ask what elements your model must have to _credibly_ address the question:

- The model cannot be so simple (or stylized) that it essentially imposes _answers /a priori/_
  - You must include all the mechanisms that generates same relevant pattern in order to not rig the results to answer the question of interest
- It must be plausible to assume parameters of the model are *invariant* to policy experiments that you plan to do
  - You should plan what experiments will be employed with this model in the very beginning

=Example: ``How important is the moral hazard effect of health insurance?''=

*** Practical Specification issues

There is an inherent conflict between:

a) Model that is rich enough to credibly address the question of interest
   - As we make model richier, we tend to get more *state variables*
b) A model that is feasible to solve and estimate
   - Too many state variables makes solution infeaseble


The art of Structural Estimation is largely about how to develop ``rich'' models that are still feasible to solve and estimate. There are strategies to reduce the number of state variables (/e.g./ fertility and labor supply, brand inventories - assuming stationary tastes) so it is not necessarily to keep track of all states altogether.

*** Solving the model & Understanding how the model works


Let's assume you have settled on a model that you think is fit for purpose. These two steps should be done in tandem. You should be writing programs to _at the same time_:

- solve the model
- simulate the model
- calculate descriptive statistics

Always begin by programming a simple special case of the model - where theory makes a clear prediction of how it should behave. If your simulations do not lines up with basic theory, you have done something wrong.

- You should add mechanisms of features to the model _one at time_.
  - Always rig the program so if a parameter (let say, $\theta$) is set to zero, the new mechanism is shut down. Then, make sure you get the *Exact* same simulation results as before if you set this parameter to zero
- Once you have introduced a new mechanism, manipulate the new parameters related to that mechanism to see what they do
  - Make sure the simulation results make intuitive sense
    - If they do not make sense, you probably have a bug
    - _Sometimes_, basic intuition turns out to be wrong and you have learned some economics
- Continuing introducing new mechanisms step-by-step until you have your full model
- By the end of this process, you will have a good understanding of how each feature of the model (and the parameters) affects behaviour
  - Spending a lot of time learning what each parameter does to behaviour also gives you a good intuitive understanding of how the model is identified and could warn about identification issues

*** Estimation

Nonlinear estimation is difficult

- You cannot just start the parameter vector at some random place and expect it to coverage
  - *Suggestion:* Finds values that fits the intercepts
- You need to *calibrate* the model to achieve a half way decent fit before iterating
  - This also teaches you a lot of how the model works
  - You should expect that this calibration process will take a long time and lots of patience
- If you find it impossible to get a decent calibration _by hand_, it means:
  - there is some important mechanism you have omitted from the model
  - you do not really understand the model
  - you are not trying hard enough
- *Strategy:* Presents the simplest model version. Discuss why it does not fit the data and what is needed to achieve it.
- Now that you are ready to estimate you need to write the code for the parameter search algorithm
  - *Recommendation:* BHHH and Simplex (and help the search algorithm by hand)
  - Only build up gradually to the full model as you are sure everything is working properly
- Estimation is not a mechanical process
  - As the parameter iterate, you should look
    - Simulation of key statistics vs. actual data
    - Values of parameters where there are some reasonable prior
  - Two types of things often go wrong
    - Some parameters go to strange values
    - Key moments do not improve or even get worse
    - These are often symptoms of bugs in the code of a flaw in the model (/e.g./ identification problem)
  - Problems in estimation are very frustrating because it can be hard to pin down the source
    - Bug in estimation code
    - Bug in solving the model
    - A flaw in the model
    - OBS: You almost never find the bug by reading the code. Hints:
      - Shut down parts of the model to figure out which part is causing the problem
      - Print out lots of stuff and check if it makes sense


*** Validation

Let's say the parameters of the model have converged to sensible looking values and the in sample fit looks OK

- A good opportunity for validation is when an experiment has been run, and you can estimate the model on the ``control data'' and see if you can forecast the ``treatment data''
- You should think about whether you can validate the model *before* you estimate it
  - Most structural papers do not do much in the way of model validation. One reason is that data needed to do validation is often not easily available

*** Policy Experiments

One of the major reasons we do structural estimation is because we can use structural model to do policy experiments
- Or we may want to use the model to optimize the parameters of a policy to maximize some objective
- Experiments only allow us to see effects of policies that have already been implemented
- A common flaw of structural papers is they do lot of work to solve and estimate the model
  - But when that is done, they do not report any interesting experiments
  - You should have some interesting experiments in mind before you even start

** Conclusion: Why do structural estimation

- One of the reasons is because you are interested in a _model itself_
- Models that we are confident in using for policy evaluation

* Structural modeling workflow

