Notes/Lecture_03.tex
% Created 2020-09-01 ter 12:15
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage{lmodern}
\usepackage[T1]{fontenc}
\usepackage[top=2cm, bottom=2cm, left=2cm, right=2cm]{geometry}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage[theorems, skins]{tcolorbox}
\usepackage[style=abnt,noslsn,extrayear,uniquename=init,giveninits,justify,sccite,
scbib,repeattitles,doi=false,isbn=false,url=false,maxcitenames=2,
natbib=true,backend=biber]{biblatex}
\usepackage{url}
\usepackage[cache=false]{minted}
\usepackage[linktocpage,pdfstartview=FitH,colorlinks,
linkcolor=blue,anchorcolor=blue,
citecolor=blue,filecolor=blue,menucolor=blue,urlcolor=blue]{hyperref}
\usepackage{attachfile}
\usepackage{setspace}
\usepackage{tikz}
\bibliography{References.bib}
\usepackage{minted}
\author{Gabriel Petrini}
\date{September 1st, 2020}
\title{Structural modeling process}
\begin{document}

\maketitle
\tableofcontents


\section{Pre-class reading: Practical Issues in Structural Estimation (\href{https://www.youtube.com/watch?v=0hazaPBAYWE}{Keane YouTube talk, 2015})}
\label{sec:org7aa7cf1}

\subsection{Structural Model Development}
\label{sec:org2a0fe8e}

Structural estimation has several key stages

\subsubsection{Theoretical model development}
\label{sec:orgf34758d}

Assume you want to build a structural model to address an \textbf{economic or policy question of interest}. A good starting point is to ask what elements your model must have to \uline{credibly} address the question:

\begin{itemize}
\item The model cannot be so simple (or stylized) that it essentially imposes \uline{answers \emph{a priori}}
\begin{itemize}
\item You must include all the mechanisms that generates same relevant pattern in order to not rig the results to answer the question of interest
\end{itemize}
\item It must be plausible to assume parameters of the model are \textbf{invariant} to policy experiments that you plan to do
\begin{itemize}
\item You should plan what experiments will be employed with this model in the very beginning
\end{itemize}
\end{itemize}

\texttt{Example: ``How important is the moral hazard effect of health insurance?''}

\subsubsection{Practical Specification issues}
\label{sec:orga0f2b2d}

There is an inherent conflict between:

\begin{enumerate}
\item Model that is rich enough to credibly address the question of interest
\begin{itemize}
\item As we make model richier, we tend to get more \textbf{state variables}
\end{itemize}
\item A model that is feasible to solve and estimate
\begin{itemize}
\item Too many state variables makes solution infeaseble
\end{itemize}
\end{enumerate}


The art of Structural Estimation is largely about how to develop ``rich'' models that are still feasible to solve and estimate. There are strategies to reduce the number of state variables (\emph{e.g.} fertility and labor supply, brand inventories - assuming stationary tastes) so it is not necessarily to keep track of all states altogether.

\subsubsection{Solving the model \& Understanding how the model works}
\label{sec:org784f19f}


Let's assume you have settled on a model that you think is fit for purpose. These two steps should be done in tandem. You should be writing programs to \uline{at the same time}:

\begin{itemize}
\item solve the model
\item simulate the model
\item calculate descriptive statistics
\end{itemize}

Always begin by programming a simple special case of the model - where theory makes a clear prediction of how it should behave. If your simulations do not lines up with basic theory, you have done something wrong.

\begin{itemize}
\item You should add mechanisms of features to the model \uline{one at time}.
\begin{itemize}
\item Always rig the program so if a parameter (let say, \(\theta\)) is set to zero, the new mechanism is shut down. Then, make sure you get the \textbf{Exact} same simulation results as before if you set this parameter to zero
\end{itemize}
\item Once you have introduced a new mechanism, manipulate the new parameters related to that mechanism to see what they do
\begin{itemize}
\item Make sure the simulation results make intuitive sense
\begin{itemize}
\item If they do not make sense, you probably have a bug
\item \uline{Sometimes}, basic intuition turns out to be wrong and you have learned some economics
\end{itemize}
\end{itemize}
\item Continuing introducing new mechanisms step-by-step until you have your full model
\item By the end of this process, you will have a good understanding of how each feature of the model (and the parameters) affects behaviour
\begin{itemize}
\item Spending a lot of time learning what each parameter does to behaviour also gives you a good intuitive understanding of how the model is identified and could warn about identification issues
\end{itemize}
\end{itemize}

\subsubsection{Estimation}
\label{sec:org22dcf2f}

Nonlinear estimation is difficult

\begin{itemize}
\item You cannot just start the parameter vector at some random place and expect it to coverage
\begin{itemize}
\item \textbf{Suggestion:} Finds values that fits the intercepts
\end{itemize}
\item You need to \textbf{calibrate} the model to achieve a half way decent fit before iterating
\begin{itemize}
\item This also teaches you a lot of how the model works
\item You should expect that this calibration process will take a long time and lots of patience
\end{itemize}
\item If you find it impossible to get a decent calibration \uline{by hand}, it means:
\begin{itemize}
\item there is some important mechanism you have omitted from the model
\item you do not really understand the model
\item you are not trying hard enough
\end{itemize}
\item \textbf{Strategy:} Presents the simplest model version. Discuss why it does not fit the data and what is needed to achieve it.
\item Now that you are ready to estimate you need to write the code for the parameter search algorithm
\begin{itemize}
\item \textbf{Recommendation:} BHHH and Simplex (and help the search algorithm by hand)
\item Only build up gradually to the full model as you are sure everything is working properly
\end{itemize}
\item Estimation is not a mechanical process
\begin{itemize}
\item As the parameter iterate, you should look
\begin{itemize}
\item Simulation of key statistics vs. actual data
\item Values of parameters where there are some reasonable prior
\end{itemize}
\item Two types of things often go wrong
\begin{itemize}
\item Some parameters go to strange values
\item Key moments do not improve or even get worse
\item These are often symptoms of bugs in the code of a flaw in the model (\emph{e.g.} identification problem)
\end{itemize}
\item Problems in estimation are very frustrating because it can be hard to pin down the source
\begin{itemize}
\item Bug in estimation code
\item Bug in solving the model
\item A flaw in the model
\item OBS: You almost never find the bug by reading the code. Hints:
\begin{itemize}
\item Shut down parts of the model to figure out which part is causing the problem
\item Print out lots of stuff and check if it makes sense
\end{itemize}
\end{itemize}
\end{itemize}
\end{itemize}


\subsubsection{Validation}
\label{sec:orgcd3e264}

Let's say the parameters of the model have converged to sensible looking values and the in sample fit looks OK

\begin{itemize}
\item A good opportunity for validation is when an experiment has been run, and you can estimate the model on the ``control data'' and see if you can forecast the ``treatment data''
\item You should think about whether you can validate the model \textbf{before} you estimate it
\begin{itemize}
\item Most structural papers do not do much in the way of model validation. One reason is that data needed to do validation is often not easily available
\end{itemize}
\end{itemize}

\subsubsection{Policy Experiments}
\label{sec:org08b15c2}

One of the major reasons we do structural estimation is because we can use structural model to do policy experiments
\begin{itemize}
\item Or we may want to use the model to optimize the parameters of a policy to maximize some objective
\item Experiments only allow us to see effects of policies that have already been implemented
\item A common flaw of structural papers is they do lot of work to solve and estimate the model
\begin{itemize}
\item But when that is done, they do not report any interesting experiments
\item You should have some interesting experiments in mind before you even start
\end{itemize}
\end{itemize}

\subsection{Conclusion: Why do structural estimation}
\label{sec:org2ce18c0}

\begin{itemize}
\item One of the reasons is because you are interested in a \uline{model itself}
\item Models that we are confident in using for policy evaluation
\end{itemize}

\section{Structural modeling workflow}
\label{sec:org3f8e21b}
