Notes/Lecture_03.tex

\subsection{An example model}
\label{sec:org0c730b1}

To help fix ideas, let's revisit a commonly used model in introductory econometrics:


\begin{align}
\log(w_{i}) =& \beta_0 + \beta_1 s_{i} + \beta_2 x_{i} + \beta_3 x^2_{i} + \varepsilon_{i}
\label{eq:basicmincer}
\end{align}

where we have cross-sectional data and where
\begin{itemize}
\item \(i\) indexes individuals
\item \(w_{i}\) is employment income
\item \(s_{i}\) is years of schooling
\item \(x_{i}\) is years of work experience (or, more commonly, \uline{potential} work experience)
\item \(\varepsilon_{i}\) is anything else that determines income
\end{itemize}

We want to estimate \(\left(\beta_1,\beta_2,\beta_3\right)\), which are \textbf{returns to human capital investment}

\subsubsection{Quick review}
\label{sec:orgbb38586}

\begin{itemize}
\item It is nearly certain that \eqref{eq:basicmincer} suffers from omitted variable bias

\begin{itemize}
\item i.e. there are lots of factors in \(\varepsilon_{i}\) that are correlated with both \(s_i\) and \(w_i\)
\end{itemize}

\item Thus, our estimates of \(\left(\beta_1,\beta_2,\beta_3\right)\) will not be causal

\item We could try to get causal estimates using a variety of identification strategies:

\begin{itemize}
\item find a valid instrument for \(s_i\) \cite{angristKrueger1991,card1995}
\item exploit a discontinuity in \(s_i\) \cite{ost_al2018}
\item randomize \(s_i\) \cite{attanasio_al2011}
\end{itemize}
\end{itemize}

\subsubsection{A structural view of Equation \eqref{eq:basicmincer}}
\label{sec:org35fb45c}

We know that \eqref{eq:basicmincer} will produced biased estimates, but \uline{why}? Some possibilities:

\begin{itemize}
\item \textbf{ability bias:} \(s_i\) and \(w_i\) are both positively correlated with unobservable cognitive ability
\item \textbf{comparative advantage:} multidimensional unobservable ability \(\implies\) self-selection into schooling
\item \textbf{credit constraints:} \(s_i\) is a costly investment; some people may not be able to borrow enough
\item \textbf{preference heterogeneity:} (differing tastes for \(s_i\), differing discount rates)
\end{itemize}

\subsection{Theoretical Model Development}
\label{sec:org2dc93f9}

\begin{itemize}
\item Since schooling has an up-front cost and long-term benefit, need a dynamic model
\begin{itemize}
\item \textbf{period 1:} decide how much schooling to get
\item \textbf{period 2:} choose whether or not to work; if working, receive income by \eqref{eq:basicmincer}
\item individuals choose schooling level to maximize lifetime utility
\end{itemize}
\item Preferences (denote utility in period \(t\) by \(u_t\), with \(s,x\) and \(w\) defined previously)
\end{itemize}


\begin{align}
u_1\left(z,c,\eta_1\right) & = f\left(z,c,\eta_1\right) \nonumber \\
u_2\left(w\left(s,x\right),k,\eta_2\right) & = g\left(w\left(s,x\right),k,\eta_2\right) \\
\label{eq:utils}
\end{align}

where \(z\) is family background, \(c\) is schooling costs, \(k\) is number of kids in adult household and \(\eta_t\) are unobservable preferences [similar to \(\varepsilon\) in \eqref{eq:basicmincer}]


With discount factor \(\delta \in \left[0,1\right]\), the discounted lifetime utility function is then


\begin{align}
V & = u_1\left(z,c,\eta_1\right) + \delta u_2\left(w\left(s,x\right),k,\eta_2\right)
\label{eq:PDV}
\end{align}

\begin{itemize}
\item Equations \eqref{eq:basicmincer}–\eqref{eq:PDV} define our model
\item A number of important questions arise (But we'll ignore these for today)
\begin{itemize}
\item Where is cognitive ability? What exactly does \(c\) represent? Where are loans?
\item Maybe people should care about \uline{consumption} in period 2, not income
\item Does family background really only enter \(u_1\) and not \(\log\left(w\right)\)?
\item Should \(x\) in \eqref{eq:basicmincer} be a function of \(s\)? (Lower \(s \implies\) longer working life)
\item What are people's beliefs about future \(k\) when deciding \(s\)?
\end{itemize}
\end{itemize}


\subsubsection{Overview of the theoretical model}
\label{sec:org3cb833f}

\begin{center}
\begin{tabular}{lllll}
\hline
\textbf{Exog} & \textbf{Endog} & \textbf{Outcome} & \textbf{Unobs} & \textbf{Parameters}\\
\hline
family background \((z)\) & schooling \((s)\) & labor income \((w)\) & income \((\varepsilon)\) & retn. human capital \((\beta)\)\\
schooling costs \((c)\) & period-2 work dec. &  & preferences \((\eta_t)\) & discount factor \((\delta)\)\\
children in household \((k)\) &  &  &  & other \(f(\cdot)\) and \(g(\cdot)\)\\
\hline
\end{tabular}
\end{center}



\subsection{Practical Specification Issues}
\label{sec:org7195d3c}

Now that we have a model, we need to figure out how to take it to data

\begin{itemize}
\item This is where we apply knowledge about \uline{our data} and \uline{stats/econometrics}
\item Key data questions:
\begin{itemize}
\item Can we observe the variables of the model in our data set?
\item If so, are they reliably measured?
\end{itemize}

\item Key specification questions:
\begin{itemize}
\item How to model \(\eta_t\) and \(\varepsilon\)? (Need to make distributional assumptions)
\item Functional forms of \(f(\cdot)\) and \(g(\cdot)\)
\item Should \(s\) be continuous (years of schooling) or discrete (college/not)?
\end{itemize}
\end{itemize}

What determines the specification is often:

\begin{itemize}
\item what is reliably measured in the data
\item what is computationally feasible to estimate
\end{itemize}

Parameters of the model either need to be \textbf{estimated} or \textbf{calibrated}

\begin{itemize}
\item e.g. often we don't have reliable data to allow us to estimate \(\delta\); we must calibrate it
\item Computational feasibility often governs how we specify the different functions

\begin{itemize}
\item e.g. \uline{linear-in-parameters} with \uline{additively separable} unobservables [like \eqref{eq:basicmincer}]
\end{itemize}
\end{itemize}

\section{Example real data}
\label{sec:orgf124b96}

Here is some real data from the most recent round of the NLSY97

\begin{verbatim}
using CSV, DataFrames, Statistics
df = CSV.read("Data/slides3data.csv"; missingstrings=["NA"])
size(df)
# outputs (6009, 12)
describe(df)
# outputs the below:
12×8 DataFrame
│ Row │ variable       │ mean     │ min  │ median  │ max     │ nunique │ nmissing │
│     │ Symbol         │ Float64  │ Real │ Float64 │ Real    │ Nothing │ Union…   │
├─────┼────────────────┼──────────┼──────┼─────────┼─────────┼─────────┼──────────┤
│ 1   │ id             │ 4534.71  │ 4    │ 4544.0  │ 9022    │         │          │
│ 2   │ female         │ 0.52671  │ 0    │ 1.0     │ 1       │         │          │
│ 3   │ black          │ 0.269762 │ 0    │ 0.0     │ 1       │         │          │
│ 4   │ latin          │ 0.210351 │ 0    │ 0.0     │ 1       │         │          │
│ 5   │ white          │ 0.511067 │ 0    │ 1.0     │ 1       │         │          │
│ 6   │ employed       │ 0.756532 │ 0    │ 1.0     │ 1       │         │          │
│ 7   │ wage           │ 25.5309  │ 8.0  │ 20.0    │ 150.0   │         │ 933      │
│ 8   │ collgrad       │ 0.350474 │ 0    │ 0.0     │ 1       │         │          │
│ 9   │ age            │ 34.967   │ 33   │ 35.0    │ 37      │         │          │
│ 10  │ parent_college │ 0.238975 │ 0    │ 0.0     │ 1       │         │          │
│ 11  │ numkids        │ 1.32684  │ 0    │ 1.0     │ 9       │         │          │
│ 12  │ efc            │ 4.2243   │ 0.0  │ 0.77763 │ 118.111 │         │          │
\end{verbatim}

\begin{itemize}
\item We have demographics/background, wages, employment status, education, fertility
\item N=6009, age \(\in \{33,\ldots,37\}\), and 35\% of respondents graduated college
\end{itemize}
