Notes/Lecture_03.org
** Setting up the specification

It looks like we can estimate some form of our model

- We have family background, cost of college (this is the =efc= variable)
- We have employment status, wage and number of children
- It looks like we'll have to have $s$ be binary (=collgrad= variable)
- Also need to assume $x = age - 18$ if non-grad, $x = age - 22$ if grad  cite:mincer1974

Then we just need to add some functional form assumptions, and we'll be ready

$\varepsilon \sim$ Normal, $\eta_t \sim$ Logistic

$$u_{i1} = \alpha_0 + \alpha_1 \text{ parent\_college} + \alpha_2 \text{ efc} + \eta_1$$

$$u_{i2} = \gamma_0 + \gamma_1 \mathbb{E} \log w_{i} + \gamma_2 \text{ numkids} + \eta_2$$

** Parameters of the empirical model

We can now detail the parameters of the empirical model

- *wage parameters* $(\beta,\sigma_{\varepsilon})$
  - The latter is the std. dev. of income shocks
- *schooling parameters* $(\alpha)$
- *employment parameters* $(\gamma,\delta)$

Then write down a statistical objective function as a fn. of data and parameters

  - e.g. maximize the likelihood, or minimize the sum of the squared residuals

** Solving and Understanding How the Model Works

Solving the model:

- solve the dynamic utility max problem for given parameter values   
- (we aren't estimating parameter values yet)
    

Understanding the model:

  - simulate data from the model  
  - make sure the simulated data is consistent with the model's implications  
  - look at descriptive statistics from the simulated data

Start with as simple of a model as possible; make sure things are working

- When introducing more complexities, do ``numerical comparative statics''
- Make sure the parameters move in the correct directions
  - e.g. $\uparrow \beta_1 \implies \uparrow$ schooling (ceteris paribus)

** Julia Example                                                   

#+BEGIN_EXAMPLE julia 
N = size(df,1)
beta = [1.65,.4,.06,-.0002]
sigma = .4;
df.exper = df.age .- ( 18*(1 .- df.collgrad) .+ 22*df.collgrad )
df.lwsim = beta[1] .+ beta[2]*df.collgrad .+ beta[3]*df.exper .+ beta[4]*df.exper.^2 .+ sigma*randn(N)
df.lw    = log.(df.wage)
#+END_EXAMPLE


We can then compare how =df.lwsim= compares with =df.lw= in the data

#+BEGIN_EXAMPLE julia
describe(df;cols=[:lw,:lwsim])
# returns
| Row | variable | mean    | min     | median  | max     | nunique | nmissing | eltype                  |
|     | Symbol   | Float64 | Float64 | Float64 | Float64 | Nothing | Union    | Type                    |
---------------------------------------------------------------------------------------------------------
| 1   | lw       | 3.06219 | 2.07944 | 2.99573 | 5.01064 |         | 933      | Union{Missing, Float64} |
| 2   | lwsim    | 2.67169 | 1.12192 | 2.67668 | 3.98557 |         |          | Float64                 |
#+END_EXAMPLE

** Estimation


Most structural models require *nonlinear estimation*

- In nonlinear optimization, starting values are crucial   
  - Initializing at random starting values is likely to give poor results
    - Keane recommends calibrating the model by hand
    - e.g. match the intercept of each equation to the $\overline{Y}$'s in the data
  - I recommend estimating an intercepts-only model (or with very few $X$'s)
    - But this advice is model-specific!

*** Example using real data

In our simple model, we can get good starting values by estimating OLS and logits
- The wage equation can be estimated by OLS (on the subsample who are employed)

#+BEGIN_EXAMPLE julia
using GLM
\hat\beta= lm(@formula(lw ~ collgrad + exper + exper^2), df[df.employed.==1,:])
# returns
Coefficients:
─────────────────────────────────────────────────────────────────────────────────
               Estimate  Std. Error    t value  Pr(>|t|)    Lower 95%   Upper 95%
─────────────────────────────────────────────────────────────────────────────────
(Intercept)   2.94607    0.323145     9.11688     <1e-18   2.31255     3.57959
collgrad      0.534326   0.0271395   19.6881      <1e-82   0.481119    0.587532
exper        -0.0265561  0.0412115   -0.644386    0.5194  -0.107351    0.0542385
exper ^ 2     0.0014304  0.00132307   1.08112     0.2797  -0.00116346  0.00402426
─────────────────────────────────────────────────────────────────────────────────
df.elwage = predict(\hat\beta, df) # generates expected log wage for all observations
r2(\hat\beta)                               # reports R2
sqrt(deviance(\hat\beta)/dof_residual(\hat\beta))  # reports root mean squared error
#+END_EXAMPLE


The $u_t$ equations can be estimated as simple logits (on the full sample)

#+BEGIN_EXAMPLE julia
\hat\alpha = glm(@formula(collgrad ~ parent_college + efc), df, Binomial(), LogitLink())
# returns
Coefficients:
──────────────────────────────────────────────────────────────────────────────────
                  Estimate  Std. Error   z value  Pr(>|z|)   Lower 95%   Upper 95%
──────────────────────────────────────────────────────────────────────────────────
(Intercept)     -1.20091    0.0364888   -32.9118    <1e-99  -1.27243    -1.1294
parent_college   1.47866    0.068433     21.6074    <1e-99   1.34453     1.61278
efc              0.0450253  0.00437704   10.2867    <1e-24   0.0364464   0.0536041
──────────────────────────────────────────────────────────────────────────────────
\hat\gamma= glm(@formula(employed ~ elwage + numkids), df, Binomial(), LogitLink())
# returns
Coefficients:
──────────────────────────────────────────────────────────────────────────────
               Estimate  Std. Error   z value  Pr(>|z|)  Lower 95%   Upper 95%
──────────────────────────────────────────────────────────────────────────────
(Intercept)  -4.25036     0.454826   -9.34503    <1e-20  -5.1418    -3.35892
elwage        1.80081     0.149078   12.0796     <1e-32   1.50863    2.093
numkids      -0.0797204   0.0218106  -3.65512    0.0003  -0.122468  -0.0369724
──────────────────────────────────────────────────────────────────────────────
#+END_EXAMPLE

*** Do these results make sense?

- It can be informative to try and interpret even these simple results

- wage equation:
    - insignificant return to experience is surprising; otherwise makes sense
- schooling choice:
    - If =efc= captures college costs, it should have a negative sign
    - This suggests omitted variable bias in this equation
- employment choice:
    - These results check out; may want to introduce nonlinearities in =numkids=

* Validation

If you have a good model, it should be *valid* (i.e. predict well out of sample)

- Validation is not always possible, but it's good to do if you can

  - e.g. if experimental data, estimate on control group, validate on treatment group
  - e.g. see if model can replicate major policy change in data

- More simply, you could throw out half your data, then try to predict other half
    - This is typically not done if the full sample isn't huge

* Policy Experiments

- This is the main reason to do structural estimation!
- Structural estimation $\implies$ recovering the DGP of the model
- Once we know the DGP, we can simulate data from it and do policy experiments
    - requires having policy-invariant parameters!
- We can predict the effects of:
    - proposed policies
    - hypothetical policies    
- Contrast with RCTs, which only reveal effects of implemented policies


