Notes/Lecture_03.tex

\subsection{Setting up the specification}
\label{sec:orgfab2057}

It looks like we can estimate some form of our model

\begin{itemize}
\item We have family background, cost of college (this is the \texttt{efc} variable)
\item We have employment status, wage and number of children
\item It looks like we'll have to have \(s\) be binary (\texttt{collgrad} variable)
\item Also need to assume \(x = age - 18\) if non-grad, \(x = age - 22\) if grad  \cite{mincer1974}
\end{itemize}

Then we just need to add some functional form assumptions, and we'll be ready

\(\varepsilon \sim\) Normal, \(\eta_t \sim\) Logistic

$$u_{i1} = \alpha_0 + \alpha_1 \text{ parent\_college} + \alpha_2 \text{ efc} + \eta_1$$

$$u_{i2} = \gamma_0 + \gamma_1 \mathbb{E} \log w_{i} + \gamma_2 \text{ numkids} + \eta_2$$

\subsection{Parameters of the empirical model}
\label{sec:orgda7366d}

We can now detail the parameters of the empirical model

\begin{itemize}
\item \textbf{wage parameters} \((\beta,\sigma_{\varepsilon})\)
\begin{itemize}
\item The latter is the std. dev. of income shocks
\end{itemize}
\item \textbf{schooling parameters} \((\alpha)\)
\item \textbf{employment parameters} \((\gamma,\delta)\)
\end{itemize}

Then write down a statistical objective function as a fn. of data and parameters

\begin{itemize}
\item e.g. maximize the likelihood, or minimize the sum of the squared residuals
\end{itemize}

\subsection{Solving and Understanding How the Model Works}
\label{sec:orgd053b2c}

Solving the model:

\begin{itemize}
\item solve the dynamic utility max problem for given parameter values
\item (we aren't estimating parameter values yet)
\end{itemize}


Understanding the model:

\begin{itemize}
\item simulate data from the model
\item make sure the simulated data is consistent with the model's implications
\item look at descriptive statistics from the simulated data
\end{itemize}

Start with as simple of a model as possible; make sure things are working

\begin{itemize}
\item When introducing more complexities, do ``numerical comparative statics''
\item Make sure the parameters move in the correct directions
\begin{itemize}
\item e.g. \(\uparrow \beta_1 \implies \uparrow\) schooling (ceteris paribus)
\end{itemize}
\end{itemize}

\subsection{Julia Example}
\label{sec:org251da65}

\begin{verbatim}
N = size(df,1)
beta = [1.65,.4,.06,-.0002]
sigma = .4;
df.exper = df.age .- ( 18*(1 .- df.collgrad) .+ 22*df.collgrad )
df.lwsim = beta[1] .+ beta[2]*df.collgrad .+ beta[3]*df.exper .+ beta[4]*df.exper.^2 .+ sigma*randn(N)
df.lw    = log.(df.wage)
\end{verbatim}


We can then compare how \texttt{df.lwsim} compares with \texttt{df.lw} in the data

\begin{verbatim}
describe(df;cols=[:lw,:lwsim])
# returns
| Row | variable | mean    | min     | median  | max     | nunique | nmissing | eltype                  |
|     | Symbol   | Float64 | Float64 | Float64 | Float64 | Nothing | Union    | Type                    |
---------------------------------------------------------------------------------------------------------
| 1   | lw       | 3.06219 | 2.07944 | 2.99573 | 5.01064 |         | 933      | Union{Missing, Float64} |
| 2   | lwsim    | 2.67169 | 1.12192 | 2.67668 | 3.98557 |         |          | Float64                 |
\end{verbatim}

\subsection{Estimation}
\label{sec:org70e8789}


Most structural models require \textbf{nonlinear estimation}

\begin{itemize}
\item In nonlinear optimization, starting values are crucial   
\begin{itemize}
\item Initializing at random starting values is likely to give poor results
\begin{itemize}
\item Keane recommends calibrating the model by hand
\item e.g. match the intercept of each equation to the \(\overline{Y}\)'s in the data
\end{itemize}
\item I recommend estimating an intercepts-only model (or with very few \(X\)'s)
\begin{itemize}
\item But this advice is model-specific!
\end{itemize}
\end{itemize}
\end{itemize}

\subsubsection{Example using real data}
\label{sec:orgcfbf2a3}

In our simple model, we can get good starting values by estimating OLS and logits
\begin{itemize}
\item The wage equation can be estimated by OLS (on the subsample who are employed)
\end{itemize}

\begin{verbatim}
using GLM
\hat\beta= lm(@formula(lw ~ collgrad + exper + exper^2), df[df.employed.==1,:])
# returns
Coefficients:
─────────────────────────────────────────────────────────────────────────────────
               Estimate  Std. Error    t value  Pr(>|t|)    Lower 95%   Upper 95%
─────────────────────────────────────────────────────────────────────────────────
(Intercept)   2.94607    0.323145     9.11688     <1e-18   2.31255     3.57959
collgrad      0.534326   0.0271395   19.6881      <1e-82   0.481119    0.587532
exper        -0.0265561  0.0412115   -0.644386    0.5194  -0.107351    0.0542385
exper ^ 2     0.0014304  0.00132307   1.08112     0.2797  -0.00116346  0.00402426
─────────────────────────────────────────────────────────────────────────────────
df.elwage = predict(\hat\beta, df) # generates expected log wage for all observations
r2(\hat\beta)                               # reports R2
sqrt(deviance(\hat\beta)/dof_residual(\hat\beta))  # reports root mean squared error
\end{verbatim}


The \(u_t\) equations can be estimated as simple logits (on the full sample)

\begin{verbatim}
\hat\alpha = glm(@formula(collgrad ~ parent_college + efc), df, Binomial(), LogitLink())
# returns
Coefficients:
──────────────────────────────────────────────────────────────────────────────────
                  Estimate  Std. Error   z value  Pr(>|z|)   Lower 95%   Upper 95%
──────────────────────────────────────────────────────────────────────────────────
(Intercept)     -1.20091    0.0364888   -32.9118    <1e-99  -1.27243    -1.1294
parent_college   1.47866    0.068433     21.6074    <1e-99   1.34453     1.61278
efc              0.0450253  0.00437704   10.2867    <1e-24   0.0364464   0.0536041
──────────────────────────────────────────────────────────────────────────────────
\hat\gamma= glm(@formula(employed ~ elwage + numkids), df, Binomial(), LogitLink())
# returns
Coefficients:
──────────────────────────────────────────────────────────────────────────────
               Estimate  Std. Error   z value  Pr(>|z|)  Lower 95%   Upper 95%
──────────────────────────────────────────────────────────────────────────────
(Intercept)  -4.25036     0.454826   -9.34503    <1e-20  -5.1418    -3.35892
elwage        1.80081     0.149078   12.0796     <1e-32   1.50863    2.093
numkids      -0.0797204   0.0218106  -3.65512    0.0003  -0.122468  -0.0369724
──────────────────────────────────────────────────────────────────────────────
\end{verbatim}

\subsubsection{Do these results make sense?}
\label{sec:org19c5cb0}

\begin{itemize}
\item It can be informative to try and interpret even these simple results

\item wage equation:
\begin{itemize}
\item insignificant return to experience is surprising; otherwise makes sense
\end{itemize}
\item schooling choice:
\begin{itemize}
\item If \texttt{efc} captures college costs, it should have a negative sign
\item This suggests omitted variable bias in this equation
\end{itemize}
\item employment choice:
\begin{itemize}
\item These results check out; may want to introduce nonlinearities in \texttt{numkids}
\end{itemize}
\end{itemize}

\section{Validation}
\label{sec:org69c06db}

If you have a good model, it should be \textbf{valid} (i.e. predict well out of sample)

\begin{itemize}
\item Validation is not always possible, but it's good to do if you can

\begin{itemize}
\item e.g. if experimental data, estimate on control group, validate on treatment group
\item e.g. see if model can replicate major policy change in data
\end{itemize}

\item More simply, you could throw out half your data, then try to predict other half
\begin{itemize}
\item This is typically not done if the full sample isn't huge
\end{itemize}
\end{itemize}

\section{Policy Experiments}
\label{sec:org8d5414e}

\begin{itemize}
\item This is the main reason to do structural estimation!
\item Structural estimation \(\implies\) recovering the DGP of the model
\item Once we know the DGP, we can simulate data from it and do policy experiments
\begin{itemize}
\item requires having policy-invariant parameters!
\end{itemize}
\item We can predict the effects of:
\begin{itemize}
\item proposed policies
\item hypothetical policies
\end{itemize}
\item Contrast with RCTs, which only reveal effects of implemented policies
\end{itemize}
