Notes/Lecture_03.org
** Example using real data

- We have two policy variables we could play with

    1. =efc= (i.e. how much gov't subsidizes college tuition & fees)
    2. return to schooling (this could change due to e.g. technological change)

- Here's how we would look at a counterfactual with lower cost:
#+BEGIN_EXAMPLE julia
df_cfl     = deepcopy(df)
df_cfl.efc = df.efc .- 1         # change value of efc to be $1,000 less
df.basesch = predict(\hat\alpha, df)     # predicted collgrad probabilities under status quo
df.cflsch  = predict(\hat\alpha, df_cfl) # predicted collgrad probabilities under counterfactual
describe(df;cols=[:basesch,:cflsch])
# returns
│ Row │ variable │ mean     │ min      │ median   │ max      │ nunique │ nmissing │
│     │ Symbol   │ Float64  │ Float64  │ Float64  │ Float64  │ Nothing │ Int64    │
├─────┼──────────┼──────────┼──────────┼──────────┼──────────┼─────────┼──────────┤
│ 1   │ basesch  │ 0.350474 │ 0.231313 │ 0.24387  │ 0.986715 │         │ 0        │
│ 2   │ cflsch   │ 0.341794 │ 0.223404 │ 0.235663 │ 0.986111 │         │ 0        │
#+END_EXAMPLE

Average likelihood of =collgrad= _declines_ from 35% to 34.2%

- This doesn't make sense because the =efc= coefficient didn't make sense
- We can't assess the counterfactual of increasing the return to schooling
- Because =elwage= doesn't directly enter the =collgrad= logit model
- This is because we aren't really estimating the dynamic model yet



* Conclusions

** In summary: Why structural estimation?

- Want to examine effects of policies not yet implemented
- Learn more about economics by looking through the lens of a model
- Assess performance of theoretical models in explaining real-world data
- Can be used to build up long-run ``canonical'' models of behavior in many areas
- It can be really fun to do more complicated econometrics beyond simple regressions
- Observational data is much cheaper to collect than experimental data


** In summary: Why _not_ structural estimation?

- It's really difficult to write down and estimate a tractable, realistic model!
- It requires additional effort beyond data preparation and running regressions
- Understanding identification of the model takes a lot of effort, too
- It can be really miserable to try and debug the code of a structural estimation
- Many structural models can take weeks to estimate one specification
    - in addition to months spent coding/debugging beforehand
- As you can see, even with a simple model things have already gotten complicated!
