Notes/Lecture_03.tex


\subsection{Example using real data}
\label{sec:org5e8fe50}

\begin{itemize}
\item We have two policy variables we could play with

\begin{enumerate}
\item \texttt{efc} (i.e. how much gov't subsidizes college tuition \& fees)
\item return to schooling (this could change due to e.g. technological change)
\end{enumerate}

\item Here's how we would look at a counterfactual with lower cost:
\end{itemize}
\begin{verbatim}
df_cfl     = deepcopy(df)
df_cfl.efc = df.efc .- 1         # change value of efc to be $1,000 less
df.basesch = predict(\hat\alpha, df)     # predicted collgrad probabilities under status quo
df.cflsch  = predict(\hat\alpha, df_cfl) # predicted collgrad probabilities under counterfactual
describe(df;cols=[:basesch,:cflsch])
# returns
│ Row │ variable │ mean     │ min      │ median   │ max      │ nunique │ nmissing │
│     │ Symbol   │ Float64  │ Float64  │ Float64  │ Float64  │ Nothing │ Int64    │
├─────┼──────────┼──────────┼──────────┼──────────┼──────────┼─────────┼──────────┤
│ 1   │ basesch  │ 0.350474 │ 0.231313 │ 0.24387  │ 0.986715 │         │ 0        │
│ 2   │ cflsch   │ 0.341794 │ 0.223404 │ 0.235663 │ 0.986111 │         │ 0        │
\end{verbatim}

Average likelihood of \texttt{collgrad} \uline{declines} from 35\% to 34.2\%

\begin{itemize}
\item This doesn't make sense because the \texttt{efc} coefficient didn't make sense
\item We can't assess the counterfactual of increasing the return to schooling
\item Because \texttt{elwage} doesn't directly enter the \texttt{collgrad} logit model
\item This is because we aren't really estimating the dynamic model yet
\end{itemize}



\section{Conclusions}
\label{sec:orgb28b7fe}

\subsection{In summary: Why structural estimation?}
\label{sec:org9000536}

\begin{itemize}
\item Want to examine effects of policies not yet implemented
\item Learn more about economics by looking through the lens of a model
\item Assess performance of theoretical models in explaining real-world data
\item Can be used to build up long-run ``canonical'' models of behavior in many areas
\item It can be really fun to do more complicated econometrics beyond simple regressions
\item Observational data is much cheaper to collect than experimental data
\end{itemize}


\subsection{In summary: Why \underline{not} structural estimation?}
\label{sec:org2fec7b4}

\begin{itemize}
\item It's really difficult to write down and estimate a tractable, realistic model!
\item It requires additional effort beyond data preparation and running regressions
\item Understanding identification of the model takes a lot of effort, too
\item It can be really miserable to try and debug the code of a structural estimation
\item Many structural models can take weeks to estimate one specification
\begin{itemize}
\item in addition to months spent coding/debugging beforehand
\end{itemize}
\item As you can see, even with a simple model things have already gotten complicated!
\end{itemize}
\end{document}
